Repository: rekiem233/CVUSV
Catalog: CVUSV/Locales/Resources.*.resx
Languages: es_mx

# lblw1b
source: <ul> <li> Design of physical and logical architecture on Azure and Firebase.</li> <li> Realtime database design.</li> <li> Development of a multiplatform application with NET MAUI C# for sale to the private sector</li> <li> Release on Apple and Android store</li> <li> Infrastructure provisioning for DevOps with Azure Cloud. </li> <li> Kubernetes Cluster Provisioning. <li> Programming scripts in terraform for provisioning services in Azure Cloud (Service Bus, Azure Functions, SignalR, KeyVault, Storage, API Management Dockerization of services. <li> .NET gRPC C# Web API programming for user information management. <li> Programming methods to manage Firebase storage. </li> <li> Programming methods for Firebase RealTime DataBase. </li> <li> Programming authentication methods in Firebase. </li> <li> Programming methods for using push notifications. </li> <li> API connector programming for chatGPT use. </li> <li> Lambda function programming. </li> <li> Connector programming for Azure Service Bus.</li> <li> Programming functions for Messaging management (Queues and Topics). </li> <li> Implementation of Observability with Graphana, Jaegger and Istio. </li> <li> Implementation of MVVM pattern. Using GCP CLI to use push notifications</li> </ul>
es_mx: <ul><li>Diseño de arquitectura física y lógica sobre Azure y Firebase.</li> <li>Diseño de base de datos Realtime.</li> <li>Desarrollo de una aplicación mulltiplataforma con NET MAUI C# para venta a sector privado</li> <li>Publicación en la tienda de Apple y Android</li> <li>Aprovisionamiento de infraestructura para DevOps con Azure Cloud.&nbsp;</li> <li>Aprovisionamiento de Cluster de Kubernetes.&nbsp;</li> <li>Programación de scripts en terraform para aprovisionamiento de servicios en Azure Cloud(Service Bus, Azure Functions, SignalR,KeyVault, Storage, API Management Dockerizacion de servicios.&nbsp;</li> <li>Programación de Web API .NET gRPC C# para manejo de información de usuario. Programación de métodos para manejo de Firebase storage.&nbsp;</li> <li>Programación de métodos para Firebase RealTime DataBase.&nbsp;</li> <li>Programación de métodos de autenticación en Firebase.&nbsp;</li> <li>Programación de métodos para uso de notificaciones push.&nbsp;</li> <li>Programación de conector API para uso de chatGPT.&nbsp;</li> <li>Programación de funciones Lambda.&nbsp;</li> <li>Programación de conector para Azure Service Bus.</li> <li>Programación de funciones para manejo de Mensajería(Queues y Topics) .&nbsp;</li> <li>Implementación de Observabilidad con Graphana, Jaegger e Istio.&nbsp;</li> <li>Implementación de patrón MVVM. Uso de GCP CLI para uso de notificaciones push</li></ul>

# lblw2
source: Architecture, Mobile and Web Development ,TechLead
es_mx: Arquitectura y Desarrollo Movil y Web

# lblw2w
source: Architecture, Development, DevOps,TechLead
es_mx: Arquitectura, Desarrollo, DevOps,TechLead

# lblw3
source: <p>Maintenance and migration of backend services for hotel quotes and bookings, design, development and implementation of new services to<br />provide asynchronous connectivity between B2C, B2B, B2B2C and affiliate business lines, development of services for connectivity with channel managers<br />through Open Travel)<br />Planning and design of logical architecture for the development of micro services connectors for the enrollment of hotel contracts to the different business lines that consume them.</p> <p>Specific improvements to services to improve their response times and availability, as well as opentrace and monitoring.</p> <p>Creation and assignment of user stories to the work team in KanBan DevOps</p> <p>&bull; Migration of HBSI, RateTigger and Gateway interfaces to NET Core.<br />&bull; Architecture design for migration of the Hotel Quote Web API to NET Core.<br />&bull; Architecture design for Hotel Rate API (Python)<br />&bull; Architecture design for Disney Push OTA Connector.<br />&bull; Architecture design for SynXis, Sabre OTA Push Connector.<br />&bull; Architecture design for DerbySoft OTA Push Connector.<br />&bull; Architecture design for HBSI OTA Push Connector.<br />&bull; Development of Booking and reservation cancellation connectors.<br />&bull; Development of backend functionality and database for push connectors.<br />&bull; Development of resilient architectures for HTTP connectors with retry and timeout policies.<br />&bull; Development of Architecture for Intelligent Business and Revenue quote service, strategies.<br />&bull; Architecture improvement for BestDay interface.<br />&bull; Performance improvement for third-party PULL quote interfaces (Restel, Tourico, Get a Room, IDISHO, GTA)<br />&bull; Architecture improvement for Valkirya interface.<br />&bull; Improvement and maintenance of product APIs.<br />&bull; Maintenance of availability viewers.<br />&bull; Production launch Installation of NgInx, Docker, k8s Proxies.<br />&bull; Development of pipelines.<br />&bull; Provisioning of development and QA environments.<br />&bull; Instrumentation metrics integration<br />&bull; Dashboard design.<br />&bull; Development of SQL scripts, functions, stored procedures, triggers.<br />&bull; Development of MySQL MSSQL migration synchronizers.<br />&bull; Migration of Azure services to Google Cloud Platform.<br />&bull; Design and execution of Testware for distributed load testing.<br />&bull; Creation of Let's Encript SSL certificates for secure connectivity between interfaces.<br />&bull; Integration of ElasticSearch and kibana for connectivity and monitoring between applications.<br />&bull; Execution of Daily KanBan board.<br />&bull; Creation of Epics.<br />&bull; Code Review</p> <p><strong>Technologies</strong>:<br />▪ ASP.NET Frameworks VB C#<br />▪ ASP.NET Core C# 3 MVC<br />▪ MySQL<br />▪ MSSQL<br />▪ Azure<br />▪ GCP<br />▪ NodeJS<br />▪ Python<br />▪ TypeScript<br />▪ JavaScript<br />▪ Service Bus /Pub Sub<br />▪ OTA Connectors<br />▪ Functions<br />▪ Elastic Search<br />▪ Graphana, Kibana<br />▪ Angular<br />▪ XML, JSon, gRPC, MsgPack<br />▪ Docker K8s<br />▪ Linux<br /><strong>Achievements</strong>:<br />&bull; Reduction in application resource consumption.<br />&bull; Reduction in service consumption on the cloud and reduction in costs for SQL Server license payments.<br />&bull; Putting API Connectors into production<br />&bull; Implementation of best practices.</p>
es_mx: <p>Mantenimiento y migraci&oacute;n de servicios backend de cotizaci&oacute;n y booking en ramo hotelero, dise&ntilde;o, desarrollo e implementaci&oacute;n de nuevos servicios para <br />proporcionar una conectividad asincr&oacute;nica entre l&iacute;neas de negocio B2C, B2B, B2B2C y afiliados, desarrollo de servicios para conectividad con channels managers <br />por medio de Open Travel)</p> <p>Planeaci&oacute;n y dise&ntilde;o de arquitectura l&oacute;gica para el desarrollo de micro servicios conectores para el enrolamiento de contratos hoteleros a las diferentes l&iacute;neas de <br />negocio que las consumen.</p> <p>Mejoras puntuales a servicios para mejorar sus tiempos de respuesta y disponibilidad, as&iacute; como el opentrace y monitoreo. </p> <p>Creaci&oacute;n y asignaci&oacute;n de historias de usuario a equipo de trabajo en KanBan DevOps <br /><br />&bull; Migraci&oacute;n de interfaces HBSI, RateTigger y Gateway a NET Core. <br />&bull; Dise&ntilde;o de Arquitectura para migraci&oacute;n de Web API de Hoteles Cotizaci&oacute;n NET Core. <br />&bull; Dise&ntilde;o de Arquitectura para API de Hoteles Tarifaria (Python) <br />&bull; Dise&ntilde;o de Arquitectura para Conector OTA Push Disney. <br />&bull; Dise&ntilde;o de Arquitectura para Conector OTA Push SynXis, Sabre. <br />&bull; Dise&ntilde;o de Arquitectura para Conector OTA Push DerbySoft. <br />&bull; Dise&ntilde;o de Arquitectura para Conector OTA Push HBSI. <br />&bull; Desarrollo de conectores de Booking y cancelaci&oacute;n de reservas. <br />&bull; Desarrollo de funcionalidad backend y base de datos para conectores push. <br />&bull; Desarrollo de arquitecturas resistentes para conectores HTTP con Pol&iacute;ticas de reintento y timeout. <br />&bull; Desarrollo de Arquitectura para Servicio de cotizaci&oacute;n Bussines Intelligente y Revenue, estrategias. <br />&bull; Mejoramiento de Arquitectura para interface BestDay. <br />&bull; Mejoramiento de performance a interfaces quote PULL de terceros (Restel, Tourico, Get a Room, IDISHO, GTA) <br />&bull; Mejoramiento de Arquitectura para interface Valkirya. <br />&bull; Mejoramiento y mantenimiento de Apis de producto. <br />&bull; Mantenimiento a visores de disponibilidad. <br />&bull; Puesta en producci&oacute;n Instalaci&oacute;n de Proxys NgInx, Docker, k8s. <br />&bull; Desarrollo de pipelines. <br />&bull; Aprovisionamiento de ambientes de desarrollo y QA. <br />&bull; Integraci&oacute;n de m&eacute;tricas de instrumentaci&oacute;n <br />&bull; Dise&ntilde;o de dashboards. <br />&bull; Desarrollo de scripts SQL, funciones, procedimientos almacenados, triggers. <br />&bull; Desarrollo de sincronizadores de migraci&oacute;n MySQL MSSQL. <br />&bull; Migraci&oacute;n de servicios de Azure a Google Cloud Platform. <br />&bull; Dise&ntilde;o y ejecuci&oacute;n de Testware para pruebas distribuidas de carga. <br />&bull; Creaci&oacute;n de certificados SSL Let&acute;s Encript para conectividad segura entre interfaces. <br />&bull; Integraci&oacute;n de ElasticSearch y kibana para conectividad y monitoreo entre aplicaciones. <br />&bull; Ejecuci&oacute;n de junta Daily KanBan. <br />&bull; Creaci&oacute;n de &Eacute;picas. <br />&bull; Code Review<br /><br /><strong>Tecnolog&iacute;as</strong>: <br />▪ ASP.NET Frameworks VB C# <br />▪ ASP.NET Core C# 3 MVC <br />▪ MySQL <br />▪ MSSQL <br />▪ Azure <br />▪ GCP <br />▪ NodeJS <br />▪ Python <br />▪ TypeScript <br />▪ JavaScript <br />▪ Service Bus /Pub Sub <br />▪ OTA Conectores <br />▪ Functions <br />▪ Elastic Search <br />▪ Graphana, Kibana <br />▪ Angular <br />▪ XML, JSon, gRPC, MsgPack <br />▪ Docker K8s <br />▪ Linux</p> <p><br /><strong>Logros</strong>: <br />&bull; Reducci&oacute;n de consume de recursos de aplicaciones. <br />&bull; Reducci&oacute;n de consumo de servicios en las nueves y reducci&oacute;n de costos en pago de licencias SQL Server. <br />&bull; Puesta en producci&oacute;n de Conectores API <br />&bull; Implementaci&oacute;n de buenas pr&aacute;cticas. </p>

# lblw4w
source: <ul> <li>Project OXXO(C#, SQL Server)</li> <li>Project Ecommerce Walmart(C#, ASP.NET, SQL Server)</li> <li>Projects Grupo Salinas(C#, Visual Basic, JavaScript, Java, SQL Server)</li> <li>Projects Segob(Java, MySql, JavaScript, PHP, ASP)</li> </ul>
es_mx: <ul> <li>Proyecto OXXO(C#, SQL Server)</li> <li>Proyecto Ecommerce Walmart(C#, ASP.NET, SQL Server)</li> <li>Proyectos Grupo Salinas(C#, Visual Basic, JavaScript, Java, SQL Server)</li> <li>Proyectos Segob(Java, MySql, JavaScript, PHP, ASP)</li> </ul>

# lblyears
source: years old
es_mx: años

# lbmeasa
source: Message
es_mx: Mensaje

# lbmet
source: Methodologies and techniques
es_mx: Metodologías y técnicas

# lbnacimiento
source: DOB 1.12.1983
es_mx: Fecha de nacimiento 12.01.1983

# lbw1
source: Development Web ASP.NET
es_mx: Desarrollo Web ASP.NET

# MenuCertificaciones
source: Certs
es_mx: Certificaciones

# MenuConocimientos
source: Skills
es_mx: Habilidades

# MenuContacto
source: Contact
es_mx: Contacto

# MenuExp
source: Experiencie
es_mx: Experiencia

# MenuHome
source: Profile
es_mx: Perfil

# MenuPortafolio
source: Portfolio
es_mx: Portafolio

# MenuReferencias
source: Portfolio
es_mx: Portafolio
