Repository: rekiem233/CVUSV
Catalog: CVUSV/Locales/Resources.*.resx
Languages: es_mx

# dataWorkNexta
source: <p style="padding-left: 40px;"><strong><em><u><span>Activities</span></u></em></strong></p> <ul> <li><span>Participation in HEB and Cklass projects and internal clients.</span></li> <li><span>Backend architecture design for HEB Monterrey commercial chain electronic commerce system.</span><br /><span>Backend and frontend architecture design for Ticket Digital HEB.</span><br /><span>Backend and frontend architecture design for Cklass</span></li> <li><span>Physical and logical architecture design for the development of the new online sales system of the HEB commercial chain, the operation was designed between</span><br /><span>services to connect the sales and availability of products from the 38 stores that operate in the city of monterrey, improving the experience of</span><br /><span>users when buying online from the application or web portal.</span></li> <li><span>Physical and logical architecture design for him sent tickets digitally when paying in boxes, the user can receive a ticket on his cell phone</span><br /><span>link to your purchase ticket if you wish.</span></li> <li><span>Physical and logical architecture design for the development of the online sales system of the company cklass, a reengineering of the sales, web, mobile and administration channels was generated.</span><br /><span>Coordination of equipment and assignment of tasks in Agile Kanban methodology.</span><br /><span>Activities.</span></li> <li><span>Business operation analysis for the development of base technological solutions, coordination of work teams, provision of environments of</span><br /><span>programming, migration of legacy services to new technologies and innovation implementing new software design patterns for the high</span><br /><span>availability.</span></li> <li><span>Implementation of DevOps environment for Cklass project.</span></li> <li><span>Base code programming for Android mobile application.</span></li> <li><span>BackEnd base code programming Java microservices and gRPC.</span></li> <li><span>FrontEnd Angular base code programming.</span></li> <li><span>Terraform base code programming for IaC.</span></li> <li><span>SQL database design and standardization.</span></li> <li><span>Amplify implementation for development.</span></li> <li><span>Base code programming.</span></li> <li><span>Configuration of Windows servers for application deployment.NET C #</span></li> <li><span>Implementation of SQS and PIXES Models (inventory photos for synchronization with Tibco)</span></li> </ul> <p style="padding-left: 40px;"><strong><em><u><span>Technologies</span></u></em></strong><span>:</span></p> <ul> <li><span>Android Studio Kotlin</span></li> <li><span>Java 11 GRPC Spring Boot REST API</span></li> <li><span>SQL Server</span></li> <li><span>GitLab / DevOps Pipelines with ArgoCD DataDog</span></li> <li><span>Sybase</span></li> <li><span>Azure (Functions, AD, ServiceBus)</span></li> <li><span>AWS (Cognito, MSK, EventBridge, API Gateway.EC2, ECS, EKS, AppSync, S3, Lambda, ECR, RabbitMQ)</span></li> <li><span>NodeJS</span></li> <li><span>Python</span></li> <li><span>Typescript</span></li> <li><span>JavaScript</span></li> <li><span>Services Bus / Pub Sub</span></li> <li><span>Step Functions</span></li> <li><span>Elastic Search</span></li> <li><span>Graphana, Kibana</span></li> <li><span>React</span></li> <li><span>Unix, Linux, Windows</span></li> <li><span>Docker and Kubernetes</span></li> </ul> <p style="padding-left: 40px;"><strong><em><u><span>Achievements</span></u></em></strong><em><u><span>:</span></u></em></p> <ul> <li><span>High availability of HEB online products.</span></li> <li><span>High performance of backend services.</span></li> <li><span>Ecological impact when receiving a purchase ticket via digital.</span></li> <li><span>High performance and IOS / Android reactive applications, Web.</span></li> <li><span>Implementation of good practices and innovation.</span></li> <li><span>Integration of high performance microservices with gRPC.</span></li> <li><span>Customer satisfaction.</span></li> <li><span>Implementation DevOps project Cklass.</span></li> </ul>
es_mx: <p style="padding-left: 40px;"><strong><em><u>Actividades</u></em></strong></p> <ul> <li>Participaci&oacute;n en proyectos HEB y Cklass y clientes internos.</li> <li>Dise&ntilde;o de arquitectura backend para sistema de comercio electr&oacute;nico de cadena comercial HEB Monterrey. <br />Dise&ntilde;o de arquitectura backend y frontend para Ticket Digital HEB. <br />Dise&ntilde;o de arquitectura backend y frontend para Cklass</li> <li>Dise&ntilde;o de arquitectura f&iacute;sica y l&oacute;gica para el desarrollo del nuevo sistema de ventas en l&iacute;nea de la cadena comercial HEB, se dise&ntilde;&oacute; la operaci&oacute;n entre <br />servicios para conectar las ventas y disponibilidad de productos de las 38 tiendas que operan en la ciudad de monterrey, mejorando la experiencia de <br />usuarios al momento de comprar en l&iacute;nea desde la aplicaci&oacute;n o portal web.</li> <li>Dise&ntilde;o de arquitectura f&iacute;sica y l&oacute;gica para &eacute;l envi&oacute; de los tickets de forma digital al momento de pagar en cajas, el usuario podr&aacute; recibir en su celular un <br />enlace con el ticket de su compra en caso de que lo desee.</li> <li>Dise&ntilde;o de arquitectura f&iacute;sica y l&oacute;gica para desarrollo de sistema de ventas online de la empresa cklass, se gener&oacute; una reingenier&iacute;a de los canales de ventas, web, m&oacute;vil y administraci&oacute;n. <br />Coordinaci&oacute;n de equipo y asignaci&oacute;n de tareas en metodolog&iacute;a &Aacute;gil Kanban. <br />Actividades.</li> <li>An&aacute;lisis de operaci&oacute;n de negocio para el desarrollo de soluciones tecnol&oacute;gicas base, coordinaci&oacute;n de equipos de trabajo, aprovisionamiento de ambientes de <br />programaci&oacute;n, migraci&oacute;n servicios legacy a nuevas tecnolog&iacute;as e innovaci&oacute;n implementando nuevos patrones de dise&ntilde;o de software para el alta <br />disponibilidad.</li> <li>Implementaci&oacute;n de ambiente DevOps para proyecto Cklass.</li> <li>Programaci&oacute;n de c&oacute;digo base para aplicaci&oacute;n m&oacute;vil Android.</li> <li>Programaci&oacute;n de c&oacute;digo base BackEnd microservicios Java y gRPC.</li> <li>Programaci&oacute;n de c&oacute;digo base FrontEnd Angular.</li> <li>Programaci&oacute;n de c&oacute;digo base Terraform para IaC.</li> <li>Dise&ntilde;o y normalizaci&oacute;n de base de datos SQL.</li> <li>Implementaci&oacute;n de Amplify para desarrollo.</li> <li>Programaci&oacute;n de c&oacute;digo base.</li> <li>Configuraci&oacute;n de servidores Windows para despliegue de aplicaciones .NET C#</li> <li>Implementaci&oacute;n de SQS y Modelos de PIXES(fotos de inventario para sincronizaci&oacute;n con Tibco)</li> </ul> <p style="padding-left: 40px;"><strong><em><u>Tecnolog&iacute;as</u></em></strong>:</p> <ul> <li>Android Studio Kotlin</li> <li>Java 11 GRPC Spring Boot REST API</li> <li>SQL Server</li> <li>GitLab/Pipelines DevOps con ArgoCD DataDog</li> <li>Sybase</li> <li>Azure (Functions, AD, ServiceBus)</li> <li>AWS (Cognito, MSK, EventBridge, API Gateway.EC2, ECS, EKS, AppSync, S3, Lambda, ECR, RabbitMQ)</li> <li>NodeJS</li> <li>Python</li> <li>Typescript</li> <li>JavaScript</li> <li>Services Bus /Pub Sub</li> <li>Step Functions</li> <li>Elastic Search</li> <li>Graphana, Kibana</li> <li>React</li> <li>Unix, Linux, Windows</li> <li>Docker y Kubernetes</li> </ul> <p style="padding-left: 40px;"><strong><em><u>Logros</u></em></strong><em><u>:</u></em></p> <ul> <li>Alta disponibilidad de productos en l&iacute;nea HEB.</li> <li>Alto desempe&ntilde;o de servicios backend.</li> <li>Impacto ecol&oacute;gico al recibir ticket de compras v&iacute;a digital.</li> <li>Alto rendimiento y aplicaciones reactivas IOS/Android, Web</li> <li>Implementaci&oacute;n de buenas pr&aacute;cticas e innovaci&oacute;n.</li> <li>Integracion de microservicios de alta rendimiento con gRPC</li> <li>Satisfacci&oacute;n al cliente</li> <li>Implementacion DevOps proyecto Cklass</li> </ul> <p>&nbsp;</p>

# lbarchi
source: Architecture
es_mx: Arquitectura

# lbg5
source: Consultant, Client Assignment
es_mx: Consultor, Asignación con el cliente

# lbl1
source: Programming Languages
es_mx: Lenguajes de Programación

# lbl10
source: DataBases
es_mx: Bases de datos

# lbl11
source: Operating Systems
es_mx: Sistemas operativos

# lbl12
source: Tests
es_mx: Pruebas

# lbl14
source: Security
es_mx: Seguridad

# lbl2
source: Mobile Development
es_mx: Desarrollo Móvil

# lbl3
source: Patterns
es_mx: Patrones de programación

# lbl4
source: Principies
es_mx: Principios de programación y Metodologías

# lbl6
source: Repositories
es_mx: Repositorios

# lbl9
source: Tools
es_mx: Herramientas

# lblaboutme
source: About me
es_mx: Acerca de mi

# lblAct
source: Task
es_mx: Actividades

# lblarchies
source: These designs were implementations and architectural proposals
es_mx: Estos diseños fueron implementaciones y propuestas de arquitectura

# lblbestdaywork
source: <p>Backend architecture design for the HEB Monterrey retail chain's e-commerce system.<br />Backend and frontend architecture design for Ticket Digital HEB.<br />Backend and frontend architecture design for Cklass</p> <p>Physical and logical architecture design for the development of the new online sales system for the HEB retail chain. The operation between services was designed to connect sales and product availability from the 38 stores that operate in the city of Monterrey, improving the user experience when purchasing online from the application or web portal.</p> <p>Physical and logical architecture design for sending tickets digitally when paying at checkouts. Users can receive a link to their purchase ticket on their cell phone if they wish.</p> <p>Physical and logical architecture design for the development of the online sales system for the company cklass. A reengineering of the sales channels, web, mobile and administration was generated.<br />Team coordination and task assignment in Agile Kanban methodology.<br />Activities.</p> <p>Business operation analysis for the development of basic technological solutions, coordination of work teams, provision of programming environments, migration of legacy services to new technologies and innovation by implementing new software design patterns for high availability.</p> <p><strong>Technologies</strong>:<br />▪ Android Studio Kotlin<br />▪ Java 11 GRPC Spring Boot REST API<br />▪ SQL Server<br />GitLab/Pipelines DevOps with ArgoCD DataDog<br />▪ Sybase<br />▪ Azure (Functions, AD, ServiceBus)<br />▪ AWS (Gateway.EC2 API, ECS, EKS, AppSync, S3, Lambda, ECR, RabbitMQ)<br />▪ NodeJS<br />▪ Python<br />▪ Typescript<br />▪ JavaScript<br />▪ Services Bus /Pub Sub<br />▪ Functions<br />▪ Elastic Search<br />▪ Graphana, Kibana<br />▪ React<br />▪ Unix, Linux, Windows<br />▪ Docker and Kubernetes</p> <p><strong>Achievements</strong>:<br />&bull; High availability of HEB online products.<br />&bull; High performance of backend services.<br />&bull; Ecological impact when receiving purchase tickets digitally.<br />&bull; High performance and responsive IOS/Android, Web applications<br />&bull; Implementation of best practices and innovation.</p>
es_mx: <p>Dise&ntilde;o de arquitectura backend para sistema de comercio electr&oacute;nico de cadena comercial HEB Monterrey. <br />Dise&ntilde;o de arquitectura backend y frontend para Ticket Digital HEB. <br />Dise&ntilde;o de arquitectura backend y frontend para Cklass </p> <p>Dise&ntilde;o de arquitectura f&iacute;sica y l&oacute;gica para el desarrollo del nuevo sistema de ventas en l&iacute;nea de la cadena comercial HEB, se dise&ntilde;&oacute; la operaci&oacute;n entre <br />servicios para conectar las ventas y disponibilidad de productos de las 38 tiendas que operan en la ciudad de monterrey, mejorando la experiencia de <br />usuarios al momento de comprar en l&iacute;nea desde la aplicaci&oacute;n o portal web. </p> <p>Dise&ntilde;o de arquitectura f&iacute;sica y l&oacute;gica para el envi&oacute; de los tickets de forma digital al momento de pagar en cajas, el usuario podr&aacute; recibir en su celular un <br />enlace con el ticket de su compra en caso de que lo desee. </p> <p>Dise&ntilde;o de arquitectura f&iacute;sica y l&oacute;gica para desarrollo de sistema de ventas online de la empresa cklass, se genero una reingenier&iacute;a de los canales de ventas,web, m&oacute;vil y administraci&oacute;n. <br />Coordinaci&oacute;n de equipo y asignaci&oacute;n de tareas en metodolog&iacute;a &Aacute;gil Kanban. <br />Actividades. </p> <p>An&aacute;lisis de operaci&oacute;n de negocio para el desarrollo de soluciones tecnol&oacute;gicas base, coordinaci&oacute;n de equipos de trabajo, aprovisionamiento de ambientes de <br />programaci&oacute;n, migraci&oacute;n servicios legacy a nuevas tecnolog&iacute;as e innovaci&oacute;n implementando nuevos patrones de dise&ntilde;o de software para la alta <br />disponibilidad.</p> <p><strong>Tecnolog&iacute;as</strong>: <br />▪ Android Studio Kotlin <br />▪ Java 11 GRPC Spring Boot REST API <br />▪ SQL Server <br />GitLab/Pipelines DevOps con ArgoCD DataDog <br />▪ Sybase <br />▪ Azure (Functions, AD, ServiceBus) <br />▪ AWS (API Gateway.EC2, ECS, EKS, AppSync, S3, Lambda, ECR, RabbitMQ) <br />▪ NodeJS <br />▪ Python <br />▪ Typescript <br />▪ JavaScript <br />▪ Services Bus /Pub Sub <br />▪ Functions <br />▪ Elastic Search <br />▪ Graphana, Kibana <br />▪ React <br />▪ Unix, Linux, Windows <br />▪ Docker y Kubernetes </p> <p><strong>Logros</strong>: <br />&bull; Alta disponibilidad de productos en l&iacute;nea HEB. <br />&bull; Alto desempe&ntilde;o de servicios backend. <br />&bull; Impacto ecol&oacute;gico al recibir ticket de compras v&iacute;a digital. <br />&bull; Alto rendimiento y aplicaciones reactivas IOS/Android, Web <br />&bull; Implementaci&oacute;n de buenas pr&aacute;cticas e innovaci&oacute;n. </p>

# lblbtdown
source: Download Resume
es_mx: Descargar CV

# lblcomen
source: ID Grade
es_mx: Cédula

# lblcorreo
source: Email
es_mx: Correo

# lbldate
source: Date
es_mx: Fecha

# lblDesc
source: Assignee
es_mx: Asignación

# lbldesc1
source: <p>I am a software engineer with extensive experience in the development, supervision and implementation of computer systems, I am a person committed to my activities with a high sense of responsibility, performing high quality work and with excellent professionalism and who is constantly learning new technologies.</p> <p>I have extensive experience designing and programming robust cloud architectures oriented to microservices, Serverless with efficient methodologies, as well as hybrid or completely cloud infrastructures of <strong>AWS, Azure, GCP, Digital Ocean and Cloudflare.</strong></p> <p>I am an expert full-stack programmer in the languages <strong>​​C#, Java, JavaScript, Python, PHP and Visual Basic </strong>and also in databases <strong>SQL Server, Sybase, Oracle, MySQL, Cassandra, MongoDB, DynamoDB</strong> as BackEnd and in <strong>Angular, NodeJS, Blazor , HTML Jquery Bootstrap, React</strong> and <strong>WebAssembly</strong> as FrontEnd and implemented countless computer systems throughout my professional experience of type Desktop, Web, Services and native mobile applications, and also an expertise in Provisioning and networks with <strong>Windows Server</strong> since the version 2002 to 2022 and on <strong>Ubuntu</strong> and <strong>CentOs</strong> <strong>Linux</strong> servers.</p> <p>I have experience in design, provisioning and configuration in continuous integration and <strong>DevOps, GitOps</strong> work environments and can serve as a <strong>Site Engineer (SRE)</strong> to ensure that systems are reliable, scalable and resilient, maintaining high levels of availability and performance.</p>
es_mx: <p>Soy un Ingeniero en computación FullStack creativo en el diseño, programación e implementación de soluciones de software, de aplicaciones web, móviles, escritorio y microservicios utilizando las herramientas más robustas y confiables del mercado entregando un trabajo excepcional y de alta calidad aplicando 30 años de experiencia en el sector.</p> <p>&nbsp;</p> <p>Domino efectivamente los lenguajes de programación Java, JavaScript, TypeScript, C#, Visual Basic, PHP y Python y un dominio de su totalidad de las bases de datos SQL Server, Oracle, MySQL, Postgresql, DynamoDB, Cassandra y MongoDB, soy apasionado a la tecnología y me gusta compartir mis conocimientos generales a través de mi canal de YouTube con el fin de ayudar a otros desarrolladores.</p> <p>Soy experto en muchos de los servicios ofrecidos por la nube de Azure, AWS, Google, FireBase y CloudFlare desde el año 2010 y cuento con una certificación en VMWare para desarrollar aplicaciones con el patrón Cloud Native para poder simplificar la infraestructura en la nube, redes, seguridad y aplicaciones con amplio expertise comprobable en sistemas Operativos Solaris, Linux y Windows.</p> <p>&nbsp;</p> <p>Tengo experiencia en tecnologías de inteligencia artificial en la modalidad de aprendizaje automático, APIs de voz y texto e idioma, APIs de imagen y video e IA generativa, que podrán encontrar como pruebas de concepto y proyectos piloto en mi canal de GitHub.</p> <p>He creado eficientes ambientes de DevOps, en la nube con herramientas para la integración y entrega continúa aplicando el concepto de Aplicaciones Modernas.</p> <p>&nbsp;</p> <p>En el año 2002 e inicios de mi carrera trabaje como Proveedor/Chofer de Hardware con Servidores Mainframe y Midrange AS/400e de la línea E-bussines donde di consultoría a empresas como Nacobre, Interfil, Rubermaid dando mantenimiento a sistemas Cobol, RPG, C++ e instalando redes y hardware aunque mi primer programa de Altas, Bajas y cambios lo programé a la edad de 12 años con el lenguaje QBASIC y Clipper en Windows 2.0 en el año 1996 para un familiar que tenía una empresa de electrónica vendiendo este sistema de clientes.</p> <p>&nbsp;</p> <p>He tenido infinidad de retos, pero los más notorios últimamente han sido poder haber contribuido en la arquitectura de alta disponibilidad de los sistemas POS de las cadenas de conveniencia OXXO, HEB eFC2, BestDay y la migración de diferentes API’S a nuevas tecnologías que se ejecutaban OnPremise a la nube y múltiples reingenierías de aplicaciones.</p>

# lbldesc2
source: I am a person committed to my activities and with a high sense of responsibility, offering high quality work and excellent professionalism.
es_mx: Soy una persona comprometida con mis actividades y con un alto sentido de responsabilidad desempeñando un trabajo de gran calidad y con excelente profesionalismo.

# lblfoto
source: Photo
es_mx: Foto

# lbliam
source: Graduate Enginer
es_mx: Ingeniero en sistemas Titulado

# lblinfra
source: Infrastructure
es_mx: Infraestructura

# lbljobs
source: Development and Architecture Leader
es_mx: Líder de Desarrollo y Arquitectura,Liderazgo

# lbllastwork
source: <ul> <li>Source code analysis and approvals with DevOps</li> <li>Operation support</li> <li>Web services provisioning</li> <li>Project leadership</li> <li>Proposal design for operation improvement</li> <li>Developer support</li> <li>Product development monitoring</li> <li>Dev, QA, PRO and Staging deployment monitoring</li> <li>Java Springboot microservices development</li> <li>Jira ticket automation</li> <li>Vault implementation</li> <li>Architecture design for data science and business intelligence</li> <li>Analysis of systems developed in AWS services</li> <li>Terraform AWS development</li> <li>Lambda Python development</li> <li>Serverless DDD architecture design</li> <li>Use of SQS</li> <li>Use of AWS services</li> <li>Implementation of integrations.</li> <li>Testing</li> </ul>
es_mx: <ul> <li>Análisis de código fuente y aprobaciones con DevOps </li> <li>Soporte a la operación </li> <li>Aprovisionamiento de servicios web </li> <li>Liderazgo de proyectos </li> <li>Diseño de propuestas para mejoramiento de operación </li> <li>Apoyo a desarrolladores </li> <li>Seguimiento a desarrollo de productos </li> <li>Seguimiento a despliegues Dev, QA, PRO y Staging </li> <li>Desarrollo de microservicios Java Springboot </li> <li>Automatizacion de tickets en jira </li> <li>Implementacion de Vault </li> <li>Diseño de arquitectura para Ciencia de datos e inteligencia de negocios </li> <li>Análisis de sistemas desarrollados en aws services</li> <li>Desarrollo terraform aws</li> <li>Desarrollo lambda Python</li> <li>Diseño de arquitectura serverless DDD</li> <li>Uso de SQS</li> <li>Uso servicios aws</li> <li>Implementación de integraciones.</li> <li>Pruebas</li> </ul>

# lblmes
source: Leave us a message
es_mx: Déjanos un mensaje

# lblnombre
source: Name
es_mx: Nombre

# lbloter
source: Others
es_mx: Otros

# lblproject
source: Project
es_mx: Proyecto

# lblpublish
source: Publish on
es_mx: Publicación en

# lblpublishAPP
source: Releases
es_mx: Liberación

# lblrama
source: Branch
es_mx: Rama

# lblresume
source: Resume
es_mx: Resumen

# lblsitedesc
source: Site made with Blazor .NET 8, EF Core, SQL Server 2019 protected with CloudFlare and set secure headers
es_mx: Sitio desarrollado con Blazor .NET 8, EF Core, SQL Server 2019 y protegido con CloudFlare con cabezeros seguros incluidos y microservicios de java

# lblsoa
source: Server App
es_mx: Servidor de aplicaciones

# lbltec
source: Technology
es_mx: Tecnología

# lbltelefono
source: Phone
es_mx: Teléfono

# lbltnsend
source: Submit
es_mx: Enviar

# lblw1a
source: <ul> <li> Invex system migration reborn 2007 </li> <li> ASP.NET MVC 4.8 solution development</li> <li> Security module migration</li> <li> Migration of personal data module</li> <li> Migration of tax calculator module</li> <li> Savings Simulator module migration</li> <li> Migration of query's to stored procedures.</li> <li> Migration of procedures module</li> <li> FAQ module migration</li> <li> Responsive style design</li> <li> Web programming password recovery service</li> <li> Update of Crystal Reports report formats</li> <li> Update of annual cap calculations for statistical reports</li> </ul>
es_mx: <ul style="list-style-type:disc;"> <li>Migración de sistema Invex renacer 2007</li> <li>Desarrollo de solucion ASP.NET MVC 4.8</li> <li><span lang="es" dir="ltr">Migración</span> de módulo de seguridad</li> <li><span lang="es" dir="ltr">Migración</span> de módulo de datos personales</li> <li><span lang="es" dir="ltr">Migración</span> de módulo de calculadora fiscal</li> <li><span lang="es" dir="ltr">Migración</span> de módulo de Simulador de ahorro</li> <li><span lang="es" dir="ltr">Migración</span> de query's a stored procedures.</li> <li><span lang="es" dir="ltr">Migración</span> de módulo de trámites</li> <li><span lang="es" dir="ltr">Migración</span> de módulo de preguntas frecuentes</li> <li>Diseño de estilos responsivos</li> <li>Programacion de web servicie de recuperacion de contraseña</li> <li>Actualizacion de formatos de reportes Crystal Reports</li> <li>Actualizacion de calculos de tope anual para reportes estadisticos</li> </ul>
