Repository: rekiem233/CVUSV
Catalog: CVUSV/Locales/Resources.*.resx
Languages: es_mx

# dataworkBestDay
source: <p style="padding-left: 40px;"><span style="text-decoration: underline;"><strong><em>Activities</em></strong></span></p> <ul> <li><span>Maintenance and migration of quote backend services and booking in the hotel industry, design, development and implementation of new services to provide asynchronous connectivity between B2C, B2B, B2B2C and affiliate lines, development of services for connectivity with channels managers through Open Travel.</span></li> <li><span>Planning and design of logical architecture for the development of connecting micro services for the enrollment of hotel contracts to the different lines of business that consume them.</span></li> <li><span>Specific improvements to services to improve their response times and availability, as well as open trace and monitoring.</span></li> <li><span>Creation and assignment of user stories to work team at KanBan DevOps</span></li> <li><span>Migration of HBSI, RateTigger and Gateway interfaces to NET Core.</span></li> <li><span>Architecture Design for Web API migration of NET Core Quote Hotels.</span></li> <li><span>Architecture Design for API of Tarifaria Hotels (Python)</span></li> <li><span>Architecture Design for OTA Push Disney Connector.</span></li> <li><span>Architecture Design for Connector OTA Push SynXis, Saber.</span></li> <li><span>Architecture Design for OTA Push DerbySoft Connector.</span></li> <li><span>Architecture Design for OTA Push HBSI Connector.</span></li> <li><span>Development of Booking connectors and cancellation of reservations.</span></li> <li><span>Development of backend functionality and database for push connectors.</span></li> <li><span>Development of resistant architectures for HTTP connectors with Retryment and timeout policies.</span></li> <li><span>Architecture Development for Bussines Intelligence and Revenue Quote Service, strategies.</span></li> <li><span>Architecture Improvement for BestDay interface.</span></li> <li><span>Performance improvement to third-party PULL quote interfaces (Restel, Tourico, Get a Room, IDISHO, GTA)</span></li> <li><span>Architecture Improvement for Valkirya interface.</span></li> <li><span>Improvement and maintenance of product Apis.</span></li> <li><span>Maintenance to availability viewers.</span></li> <li><span>Production Installation of Proxys NgInx, Docker, k8s.</span></li> <li><span>Pipeline development.</span></li> <li><span>Provision of development environments and QA.</span></li> <li><span>Integration of instrumentation metrics</span></li> <li><span>Dashboards design.</span></li> <li><span>SQL script development, functions, stored procedures, triggers.</span></li> <li><span>Development of MySQL MSSQL migration synchronizers.</span></li> <li><span>Migration of services from Azure to Google Cloud Platform.</span></li> <li><span>Testware design and execution for distributed load tests.</span></li> <li><span>Creation of SSL Let&acute;s Encript certificates for secure connectivity between interfaces.</span></li> <li><span>ElasticSearch and kibana integration for connectivity and monitoring between applications.</span></li> <li><span>Daily KanBan board execution.</span></li> <li><span>Creation of Epics.</span></li> <li><span>Code Review</span></li> </ul> <p style="padding-left: 40px;"><span style="text-decoration: underline;"><strong><em>Technologies</em>:</strong></span></p> <ul> <li><span>ASP.NET Frameworks VB C #</span></li> <li><span>ASP.NET Core C # 3 MVC</span></li> <li><span>MySQL</span></li> <li><span>MSSQL</span></li> <li><span>Azure</span></li> <li><span>GCP</span></li> <li><span>NodeJS</span></li> <li><span>Python</span></li> <li><span>TypeScript</span></li> <li><span>JavaScript</span></li> <li><span>Service Bus / Pub Sub</span></li> <li><span>OTA Connectors</span></li> <li><span>Functions</span></li> <li><span>Elastic Search</span></li> <li><span>Graphana, Kibana</span></li> <li><span>Angle</span></li> <li><span>XML, JSon, gRPC, MsgPack</span></li> <li><span>Docker K8s</span></li> <li><span>Linux Ubuntu Server</span><br /><strong><br /><span style="text-decoration: underline;"><em>Achievements</em>:</span></strong></li> </ul> <ul> <li><span>Reduction of consumption of hardware resources in Web APIs.</span></li> <li><span>Reduction of service consumption Azure OnClousd and reduction of costs in payment of SQL Server licenses.</span></li> <li><span>Production of API Connectors</span></li> <li><span>Implementation of good practices.</span></li> </ul>
es_mx: <p style="padding-left: 40px;"><span style="text-decoration: underline;"><strong><em>Actividades</em></strong></span></p> <ul> <li>Mantenimiento y migraci&oacute;n de servicios backend de cotizaci&oacute;n y booking en ramo hotelero, dise&ntilde;o, desarrollo e implementaci&oacute;n de nuevos servicios para proporcionar una conectividad asincr&oacute;nica entre l&iacute;neas de negocio B2C, B2B, B2B2C y afiliados, desarrollo de servicios para conectividad con channels managers por medio de Open Travel.</li> <li>Planeaci&oacute;n y dise&ntilde;o de arquitectura l&oacute;gica para el desarrollo de micro servicios conectores para el enrolamiento de contratos hoteleros a las diferentes l&iacute;neas de negocio que las consumen.</li> <li>Mejoras puntuales a servicios para mejorar sus tiempos de respuesta y disponibilidad, as&iacute; como el open trace y monitoreo.</li> <li>Creaci&oacute;n y asignaci&oacute;n de historias de usuario a equipo de trabajo en KanBan DevOps</li> <li>Migraci&oacute;n de interfaces HBSI, RateTigger y Gateway a NET Core.</li> <li>Dise&ntilde;o de Arquitectura para migraci&oacute;n de Web API de Hoteles Cotizaci&oacute;n NET Core.</li> <li>Dise&ntilde;o de Arquitectura para API de Hoteles Tarifaria (Python)</li> <li>Dise&ntilde;o de Arquitectura para Conector OTA Push Disney.</li> <li>Dise&ntilde;o de Arquitectura para Conector OTA Push SynXis, Sabre.</li> <li>Dise&ntilde;o de Arquitectura para Conector OTA Push DerbySoft.</li> <li>Dise&ntilde;o de Arquitectura para Conector OTA Push HBSI.</li> <li>Desarrollo de conectores de Booking y cancelaci&oacute;n de reservas.</li> <li>Desarrollo de funcionalidad backend y base de datos para conectores push.</li> <li>Desarrollo de arquitecturas resistentes para conectores HTTP con Pol&iacute;ticas de reintento y timeout.</li> <li>Desarrollo de Arquitectura para Servicio de cotizaci&oacute;n Bussines Intelligence y Revenue, estrategias.</li> <li>Mejoramiento de Arquitectura para interface BestDay.</li> <li>Mejoramiento de performance a interfaces quote PULL de terceros (Restel, Tourico, Get a Room, IDISHO, GTA)</li> <li>Mejoramiento de Arquitectura para interface Valkirya.</li> <li>Mejoramiento y mantenimiento de Apis de producto.</li> <li>Mantenimiento a visores de disponibilidad.</li> <li>Puesta en producci&oacute;n Instalaci&oacute;n de Proxys NgInx, Docker, k8s.</li> <li>Desarrollo de pipelines.</li> <li>Aprovisionamiento de ambientes de desarrollo y QA.</li> <li>Integraci&oacute;n de m&eacute;tricas de instrumentaci&oacute;n</li> <li>Dise&ntilde;o de dashboards.</li> <li>Desarrollo de scripts SQL, funciones, procedimientos almacenados, triggers.</li> <li>Desarrollo de sincronizadores de migraci&oacute;n MySQL MSSQL.</li> <li>Migraci&oacute;n de servicios de Azure a Google Cloud Platform.</li> <li>Dise&ntilde;o y ejecuci&oacute;n de Testware para pruebas distribuidas de carga.</li> <li>Creaci&oacute;n de certificados SSL Let&acute;s Encript para conectividad segura entre interfaces.</li> <li>Integraci&oacute;n de ElasticSearch y kibana para conectividad y monitoreo entre aplicaciones.</li> <li>Ejecuci&oacute;n de junta Daily KanBan.</li> <li>Creaci&oacute;n de &Eacute;picas.</li> <li>Code Review</li> </ul> <p style="padding-left: 40px;"><strong><span style="text-decoration: underline;"><em>Tecnolog&iacute;as</em></span>:</strong></p> <ul> <li>ASP.NET Frameworks VB C#</li> <li>ASP.NET Core C# 3 MVC</li> <li>MySQL</li> <li>MSSQL</li> <li>Azure</li> <li>GCP</li> <li>NodeJS</li> <li>Python</li> <li>TypeScript</li> <li>JavaScript</li> <li>Service Bus /Pub Sub</li> <li>OTA Conectores</li> <li>Functions</li> <li>Elastic Search</li> <li>Graphana, Kibana</li> <li>Angular</li> <li>XML, JSon, gRPC, MsgPack</li> <li>Docker K8s</li> <li>Linux Ubuntu Server<br /><strong><br /><span style="text-decoration: underline;"><em>Logros</em></span>:</strong></li> </ul> <ul> <li>Optimización de consumo de recursos de hardware en WEB APIs.</li> <li>Reducci&oacute;n de consumo de hardware en la nube de Azure y reducci&oacute;n de costos en pago de licencias SQL Server.</li> <li>Puesta en producci&oacute;n de Conectores API</li> <li>Implementaci&oacute;n de buenas pr&aacute;cticas.</li> </ul>

# dataWorkEngen
source: <p style="padding-left: 40px;"><strong><em><u><span>Activities</span></u></em></strong></p> <ul> <li><span>Source code analysis and approvals with DevOps</span></li> <li><span>Operation support</span></li> <li><span>Web services provisioning</span></li> <li><span>Project leadership</span></li> <li><span>Design of proposals for improvement of operation</span></li> <li><span>Support to developers</span></li> <li><span>Monitoring of product development</span></li> <li><span>Tracking Dev, QA, PRO and Staging deployments</span></li> <li><span>Java Springboot microservice development</span></li> <li><span>Ticket automation on tour</span></li> <li><span>Vault implementation</span></li> <li><span>Architecture design for Data Science and Business Intelligence</span></li> <li><span>Analysis of systems developed in aws services</span></li> <li><span>Terraform AWS Development</span></li> <li><span>Python lambda development</span></li> <li><span>DDD serverless architecture design for BigData</span></li> <li><span>Implementation of AWS SQS and MSK</span></li> <li><span>EvenBridge implementation</span></li> <li><span>Implementation of SonarQube BackEnd and FrontEnd</span></li> <li><span>I use AWS and GCP services to bring information with AppSync and GCP BigQuery</span></li> <li><span>Implementation of data push integrations&nbsp;</span></li> <li><span>Automated testing</span></li> </ul> <p style="padding-left: 40px;"><strong><em><u><span>Technologies</span></u></em></strong></p> <ul> <li><span>Java 15 to 18</span></li> <li><span>SonarQube</span></li> <li><span>Jira</span></li> <li><span>Python</span></li> <li><span>NodeJs</span></li> <li><span>AWS SQS, Lambda, EventBridge, RDS, Dynamo, FarGate, EKS, MSK, RabbitMQ, CloudWatch</span><br /><span>API Destinations, AppSync, ECS Task, APIGateWay, Cognito, Others</span></li> <li><span>AWS CodeCommit</span></li> <li><span>AWS Kinesis</span></li> <li><span>AWS Amplify</span></li> <li><span>AWS Stepfunctions</span></li> <li><span>AWS ECR</span></li> <li><span>Docker</span></li> <li><span>JavaScript</span></li> </ul> <p>&nbsp;</p> <p style="padding-left: 40px;"><strong><em><u><span>Achievements</span></u></em></strong></p> <ul> <li><span>Improved code quality.</span></li> <li><span>Transmission of knowledge to the development team.</span></li> <li><span>Application automation in Jira.</span></li> <li><span>Reduction of response times of microservices handling large volumes of data.</span></li> <li><span>Customer satisfaction.</span></li> <li><span>Technology documentation and business processes.</span></li> <li><span>Implementation of security mechanisms, resource policies, authorizations, cogito users, labeling policy</span></li> <li><span>Implementation of WAF and TLSm Mutuo to exposed services.</span></li> <li><span>Metrics</span></li> <li><span>Logs</span></li> <li><span>Observability&nbsp;</span></li> <li><span>XRay implementation (AWS xRay)</span></li> </ul>
es_mx: <p style="padding-left: 40px;"><strong><em><u>Actividades</u></em></strong></p> <ul> <li>An&aacute;lisis de c&oacute;digo fuente y aprobaciones con DevOps</li> <li>Soporte a la operaci&oacute;n</li> <li>Aprovisionamiento de servicios web</li> <li>Liderazgo de proyectos</li> <li>Dise&ntilde;o de propuestas para mejoramiento de operaci&oacute;n</li> <li>Apoyo a desarrolladores</li> <li>Seguimiento a desarrollo de productos</li> <li>Seguimiento a despliegues Dev, QA, PRO y Staging</li> <li>Desarrollo de microservicios Java Springboot</li> <li>Automatizaci&oacute;n de tickets en jira</li> <li>Implementaci&oacute;n de Vault</li> <li>Dise&ntilde;o de arquitectura para Ciencia de datos e inteligencia de negocios</li> <li>An&aacute;lisis de sistemas desarrollados en aws services</li> <li>Desarrollo Terraform AWS</li> <li>Desarrollo lambda Python</li> <li>Dise&ntilde;o de arquitectura serverless DDD para BigData</li> <li>Implementaci&oacute;n de&nbsp; AWS SQS y MSK</li> <li>Implementaci&oacute;n de EvenBridge</li> <li>Implementaci&oacute;n de SonarQube BackEnd y FrontEnd</li> <li>Uso servicios AWS y GCP para traer informaci&oacute;n con AppSync y GCP BigQuery</li> <li>Implementaci&oacute;n de integraciones push de datos&nbsp;</li> <li>Pruebas automatizadas</li> </ul> <p>&nbsp;</p> <p style="padding-left: 40px;"><strong><em><u>Tecnolog&iacute;as</u></em></strong></p> <ul> <li>Java 15 a 18</li> <li>SonarQube</li> <li>Jira</li> <li>Python</li> <li>NodeJs</li> <li>AWS SQS,Lambda, EventBridge,RDS, Dynamo, FarGate, EKS, MSK, RabbitMQ, CloudWatch<br />API Destinations, AppSync, ECS Task, APIGateWay, Cognito, Otros</li> <li>AWS CodeCommit</li> <li>AWS Kinesis</li> <li>AWS Amplify</li> <li>AWS Stepfunctions</li> <li>AWS ECR</li> <li>Docker</li> <li>JavaScript</li> </ul> <p>&nbsp;</p> <p style="padding-left: 40px;"><strong><em><u>Logros</u></em></strong></p> <ul> <li>Mejoramiento de la calidad de c&oacute;digo.</li> <li>Transmisi&oacute;n de conocimientos al equipo de desarrollo.</li> <li>Automatizaci&oacute;n de solicitudes en Jira.</li> <li>Reducci&oacute;n de tiempos de respuesta de microservicios manejando grandes vol&uacute;menes de datos.</li> <li>Satisfacci&oacute;n del cliente.</li> <li>Documentaci&oacute;n de tecnol&oacute;gica y procesos de negocio.</li> <li>Implementaci&oacute;n de mecanismos de seguridad, pol&iacute;ticas de recursos, autorizadores, usuarios de cogito, pol&iacute;tica de etiquetado</li> <li>Implementaci&oacute;n de WAF y TLSm Mutuo a servicios expuestos.</li> <li>M&eacute;tricas</li> <li>Logs</li> <li>Observabilidad&nbsp;</li> <li>Implementaci&oacute;n xRay(AWS xRay)</li> </ul> <p>&nbsp;</p>

# dataWorkKinich
source: <p style="padding-left: 40px;"><strong><em><u><span>Activities:</span></u></em></strong></p> <ul> <li><span>Architecture design for a mobile application on Android and iOS that can be used by users to have its geolocation in real time, as well as sending notifications to trusted contacts in case of general abuse towards women, which also integrates a directory and a chat with a knowledge base towards&nbsp;</span><strong><span>CHATGPT (IA)</span></strong><span>&nbsp;to serve as a psychologist and suicide prevention.</span></li> <li><span>Design of physical and logical architecture on Azure and FireBase.</span></li> <li><span>Real time database design.</span></li> <li><span>Development of a multiplatform application with NET MAUI C # for sale to the private sector</span></li> <li><span>Publishing in the Apple and Android store</span></li> <li><span>Infrastructure provisioning for DevOps with Azure Cloud.&nbsp;</span></li> <li><span>Kubernetes Cluster Supply.&nbsp;</span></li> <li><span>Terraform script programming for service provisioning in the Azure Cloud (Service Bus, Azure Functions, SignalR, KeyVault, Storage, API Management Dockerization of services.&nbsp;</span></li> <li><span>Web API programming.NET gRPC C # for handling user information. Programming of methods for managing Firebase storage.&nbsp;</span></li> <li><span>Method programming for Firebase RealTime DataBase.&nbsp;</span></li> <li><span>Programming of authentication methods in Firebase.&nbsp;</span></li> <li><span>Programming methods for using push notifications.&nbsp;</span></li> <li><span>API connector programming for chatGPT use.&nbsp;</span></li> <li><span>Lambda function programming.&nbsp;</span></li> <li><span>Connector programming for Azure Service Bus.</span></li> <li><span>Programming of functions for handling Messaging (Queues and Topics).&nbsp;</span></li> <li><span>Observability Implementation with Graphana, Jaegger and Istio.&nbsp;</span></li> <li><span>MVVM pattern implementation.</span></li> <li><span>Use of GCP CLI for use of push notifications</span><br /><br /><strong><em><u><span>Technologies:</span><br /><br /></u></em></strong></li> <li><span>Azure Services</span></li> <li><span>Firebase</span></li> <li><span>C # 7 NET MAUI</span></li> <li><span>SQL Server</span></li> <li><span>gRPC</span></li> <li><span>Docker</span></li> <li><span>ServiceBus</span></li> <li><span>Graphana</span></li> <li><span>ChatGPT</span><br /><br /><strong><em><u><span>Achievements:</span></u></em></strong></li> </ul> <ul> <li><span>User satisfaction.</span></li> <li><span>Reduction of femicides in the country.</span></li> <li><span>Improvement of the quality of life of women.</span></li> <li><span>Integration of Artificial Intelligence for the first time in web microservices.</span></li> </ul>
es_mx: <!-- ####### HEY, I AM THE SOURCE EDITOR! #########--> <p style="padding-left: 40px;"><strong><em><u>Actividades:</u></em></strong></p> <ul> <li>Dise&ntilde;o de arquitectura para una aplicaci&oacute;n m&oacute;vil en Android y iOS que pueda ser utilizada por usuarios para tener su geolocalizaci&oacute;n en tiempo real, as&iacute; como enviar notificaciones a contactos de confianza en caso de abuso en general hacia la mujer, que tambi&eacute;n integra un directorio y un chat con una base de conocimientos hacia <strong>CHATGPT(IA)</strong> que sirva como psic&oacute;logo y prevenci&oacute;n contra el suicidio.</li> <li>Dise&ntilde;o de arquitectura f&iacute;sica y l&oacute;gica sobre Azure y FireBase.</li> <li>Dise&ntilde;o de base de datos Real time.</li> <li>Desarrollo de una aplicaci&oacute;n multiplataforma con NET MAUI C# para venta a sector privado</li> <li>Publicaci&oacute;n en la tienda de Apple y Android</li> <li>Aprovisionamiento de infraestructura para DevOps con Azure Cloud.&nbsp;</li> <li>Aprovisionamiento de Cl&uacute;ster de Kubernetes.&nbsp;</li> <li>Programaci&oacute;n de scripts en terraform para aprovisionamiento de servicios en Azure Cloud(Service Bus, Azure Functions, SignalR, KeyVault, Storage, API Management Dockerizacion de servicios.&nbsp;</li> <li>Programaci&oacute;n de Web API .NET gRPC C# para manejo de informaci&oacute;n de usuario. Programaci&oacute;n de m&eacute;todos para manejo de Firebase storage.&nbsp;</li> <li>Programaci&oacute;n de m&eacute;todos para Firebase RealTime DataBase.&nbsp;</li> <li>Programaci&oacute;n de m&eacute;todos de autenticaci&oacute;n en Firebase.&nbsp;</li> <li>Programaci&oacute;n de m&eacute;todos para uso de notificaciones push.&nbsp;</li> <li>Programaci&oacute;n de conector API para uso de chatGPT.&nbsp;</li> <li>Programaci&oacute;n de funciones Lambda.&nbsp;</li> <li>Programaci&oacute;n de conector para Azure Service Bus.</li> <li>Programaci&oacute;n de funciones para manejo de Mensajer&iacute;a(Queues y Topics) .&nbsp;</li> <li>Implementaci&oacute;n de Observabilidad con Graphana, Jaegger e Istio.&nbsp;</li> <li>Implementaci&oacute;n de patr&oacute;n MVVM.</li> <li>Uso de GCP CLI para uso de notificaciones push<br /><br /><strong><em><u>Tecnolog&iacute;as:<br /><br /></u></em></strong></li> <li>Azure Services</li> <li>Firebase</li> <li>C# 7 NET MAUI</li> <li>SQL Server</li> <li>gRPC</li> <li>Docker</li> <li>ServiceBus</li> <li>Graphana</li> <li>ChatGPT<br /><br /><strong><em><u>Logros:</u></em></strong></li> </ul> <ul> <li>Satisfacci&oacute;n de los usuarios.</li> <li>Reducci&oacute;n de feminicidios en el pa&iacute;s.</li> <li>Mejoramiento de calidad de vida de las mujeres.</li> <li>Integraci&oacute;n por primera vez de Inteligencia Artificial en microservicios&nbsp; web.</li> </ul> <p>&nbsp;</p>
